read_verilog ALU_32.v

hierarchy -check -top ALU_32
proc;
opt;
synth -top ALU_32 -flatten 



dfflibmap -liberty /home/coe-10/Desktop/Technology_PDKs/SCLPDK_V3.0_KIT/scl180/stdcell/fs120/6M1L/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib 
opt;

techmap; opt;
abc /home/coe-10/Desktop/Technology_PDKs/SCLPDK_V3.0_KIT/scl180/stdcell/fs120/6M1L/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib

clean -purge
stat -liberty /home/coe-10/Desktop/Technology_PDKs/SCLPDK_V3.0_KIT/scl180/stdcell/fs120/6M1L/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib
write_verilog -noattr alu_netlist.v


