read_liberty -lib /home/coe-10/Desktop/Technology_PDKs/SCLPDK_V3.0_KIT/scl180/stdcell/fs120/6M1L/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib 


# Read the scanned Verilog generated by Fault

read_verilog alu_scanned.v.chain-intermediate.v



# Run the generic synthesis flow

hierarchy -check  -top ALU_32
proc
flatten



# Map flip-flops to your osu018 library

dfflibmap -liberty /home/coe-10/Desktop/Technology_PDKs/SCLPDK_V3.0_KIT/scl180/stdcell/fs120/6M1L/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib



# Map generic logic gates to your osu018 library

abc -liberty /home/coe-10/Desktop/Technology_PDKs/SCLPDK_V3.0_KIT/scl180/stdcell/fs120/6M1L/liberty/lib_flow_ss/tsl18fs120_scl_ss.lib



# Clean up the design

clean



# Write out the final, technology-mapped netlist

write_verilog alu_scanned_mapped.v
